{
  "Ads": [
    {
      "select_main_ads": "ADMOB",
      "select_backup_ads":"APPLOVIN-M",
      "main_ads_banner": "ca-app-pub-3940256099942544/6300978111x",
      "main_ads_intertitial":"ca-app-pub-3940256099942544/1033173712x",
      "native_for_admob":"ca-app-pub-3940256099942544/2247696111x",
      "backup_ads_banner":"db4d5e8718b97d78",
      "backup_ads_intertitial":"518cd97722c60b52",
      "interval_intertitial": 5,
      "initialize_sdk":"107355779",
      "initialize_sdk_backup_ads":"",
      "high_paying_keyword_1": "",
      "high_paying_keyword_2": "",
      "high_paying_keyword_3": "",
      "high_paying_keyword_4": "",
      "high_paying_keyword_5": "",
      "status_app": "0",
      "link_redirect": "https://"
    }
  ],
   "More": [
    {
      "id": 1,
      "title": "Giyu 3D Live Wallpaper",
      "image": "https://archive.org/download/ads_treetop_giyu/ads_treetop_giyu.png",
      "link": "https://play.google.com/store/apps/details?id=com.treetop.bgGIYUparallax"
    }
  ],
  "Categories": [
    {
      "id": 1,
      "name_category": "Tips and Trick",
      "image": "file:///android_asset/image/keteranganTIPSTRICK.png"
    },
    {
      "id": 2,
      "name_category": "Tutorial",
      "image": "file:///android_asset/image/keteranganTUTORIAL.png"
    },
    {
      "id": 3,
      "name_category": "Information",
      "image": "file:///android_asset/image/keteranganINFORMATION.png"
    },
    {
      "id": 4,
      "name_category": "Guide",
      "image": "file:///android_asset/image/keteranganGUIDE.png"
    },
    {
      "id": 5,
      "name_category": "News",
      "image": "file:///android_asset/image/keteranganNEWS.png"
    }
  ],
  "Data": [
    {
      "id": 4,
      "name_category": "Guide",
      "title": "5 Tips and Tricks to Play on the Lava Land Map",
      "image": "https://ia601408.us.archive.org/9/items/stmblgysgd/stmblgysguide5.jpg",
      "description": "Guide",
      "link": "<h3><strong>5 Tips and Tricks to Play on the Lava Land Map, Easy Ways to Win in the Stumble Guys Game, Latest Tutorials Without Cheats</strong></h3><p>Stumble Guys is a game that until now is quite fun to play with unique characters.</p><p>The excitement of playing Stumble Guys, does not escape the game modes or maps that are varied enough to be played in every round.</p><p>Recently, the latest Stumble Guys update version 0.39 has been released which presents a new map with the name 'Lava Land'.</p><p>This Lava Land map is the final map and can be played by players if they survive until the last stage in the Stumble Guys game.</p><p>This Lava Land map is quite exciting and tense because the players are required to be able to survive so as not to fall into the lava.</p><p>At first glance, the map is similar to the gameplay or playing style in the 'Honeycomb' map. The difference is, the surrounding of this map is filled with Lava and there are few rocks to step on.</p><p>So that players can win this game easily, this article will provide tips and tricks or tutorials so that they can easily conquer this 'Lava Land' Map.</p><p><strong>-Map Explanation-</strong></p><p>Although at first glance it looks similar to the 'Honeycomb' Map, in fact these two maps are different.</p><p>If on the Honeycomb map, players are required to be able to survive from the top layer so as not to fall to the bottom layer.</p><p>Especially for this Lava Land map, players must be able to climb to the top foot so as not to sink into the lava.</p><p>Even though there are only a few stone steps on the Lava Land Map, every time there will always be stones appearing as new steps.</p><p>Players must immediately jump to new rocks, in order to survive and become the winner in this Map.</p><p>When a rock appears, the player is endeavored to stand on the nearest rock so as not to sink into the lava.</p><p>The player who can survive until the end in this Lava Land map, will be the winner.</p><p><strong>-Tips and tricks-</strong></p><p>The tutorials or tips and tricks that the editors can provide, and are based on the author's observations and experiences are as follows:</p><p><em><span style="text-decoration: underline;">1. Don't rush to jump on the newly appeared stone steps</span></em></p><p>Reason: The new stone steps appear, usually too far from the position of the rock that is currently occupied.</p><p>The players need to wait for the next stone step to appear.</p><p>Believe it or not, the stone steps that will appear are always near the current position of the stone that is being stepped on.</p><p><em><span style="text-decoration: underline;">2. Keep calm and don't panic</span></em></p><p>It's no secret, panic will mess up everything you do. Likewise when playing this Stumble Guys game.</p><p>Players must remain calm and fully concentrated in order to win or conquer the Lava Land map.</p><p><em><span style="text-decoration: underline;">3. Take advantage of 'exclusive emotes'</span></em></p><p>This method is indeed a bit 'cheating' and irritates other players who don't have exclusive emotes. But believe it or not, this method actually works.</p><p>One of the emotes that are quite useful for this Lava Land Map, is the Boxing Emote.</p><p>Players need to use the Boxing Emote, in order to drop other players into the lava in this Lava Land Map.</p><p>Therefore, when playing in the Lava Land Map, it is recommended to be calm and don't panic.</p><p>Actually besides Boxing there are other emotes in this game. There are emotes hugging other players, etc.</p><p>One example of a risky emote is tackle, if it's wrong to use it, it's not your opponent who falls but yourself.</p><p><em><span style="text-decoration: underline;">4. Good internet connection</span></em></p><p>It's no secret, if almost all online games connection can be something that must be considered.</p><p>If there is a lag or unstable ping, it will greatly interfere with the comfort in the game.</p><p>Likewise, when you want to conquer this Lava Land Map, players need internet with a smooth connection.</p><p><em><span style="text-decoration: underline;">5. Don't jump on crowded steps</span></em></p><p>Although the last round usually leaves about 8 players surviving, this Lava Land map is not as simple as imagined.</p><p>Given that there are not many footholds that can be stepped on, it will often make many players forced to huddle together on the same footing.</p><p>This is a big risk, because it will make the potential fall higher.</p><p>Therefore, try as much as possible to find a foothold with the least number of players.</p><p>Those are some tips and tricks or tutorials that you can try in order to win the Lava Land map in the Stumble Guys game</p>"
    }
  ]
}
