{
  "Ads": [
    {
      "select_main_ads": "ADMOB",
      "select_backup_ads":"APPLOVIN-M",
      "main_ads_banner": "ca-app-pub-3940256099942544/6300978111x",
      "main_ads_intertitial":"ca-app-pub-3940256099942544/1033173712x",
      "native_for_admob":"ca-app-pub-3940256099942544/2247696110x",
      "backup_ads_banner":"db4d5e8718b97d78",
      "backup_ads_intertitial":"518cd97722c60b52",
      "interval_intertitial": 5,
      "initialize_sdk":"107355779",
      "initialize_sdk_backup_ads":"",
      "high_paying_keyword_1": "",
      "high_paying_keyword_2": "",
      "high_paying_keyword_3": "",
      "high_paying_keyword_4": "",
      "high_paying_keyword_5": "",
      "status_app": "0",
      "link_redirect": "https://"
    }
  ],
   "More": [
    {
      "id": 1,
      "title": "Giyu 3D Live Wallpaper",
      "image": "https://archive.org/download/ads_treetop_giyu/ads_treetop_giyu.png",
      "link": "https://play.google.com/store/apps/details?id=com.treetop.bgGIYUparallax"
    }
  ],
  "Categories": [
    {
      "id": 1,
      "name_category": "Tips and Trick",
      "image": "file:///android_asset/image/keteranganTIPSTRICK.png"
    },
    {
      "id": 2,
      "name_category": "Tutorial",
      "image": "file:///android_asset/image/keteranganTUTORIAL.png"
    },
    {
      "id": 3,
      "name_category": "Information",
      "image": "file:///android_asset/image/keteranganINFORMATION.png"
    },
    {
      "id": 4,
      "name_category": "Guide",
      "image": "file:///android_asset/image/keteranganGUIDE.png"
    },
    {
      "id": 5,
      "name_category": "News",
      "image": "file:///android_asset/image/keteranganNEWS.png"
    }
  ],
  "Data": [
    {
      "id": 1,
      "name_category": "Tips and Trick",
      "title": "5 Tips for Playing Stumble Guys to Win More Often",
      "image": "https://ia601408.us.archive.org/9/items/stmblgysgd/stmblgysguide1.jpg",
      "description": "Tips & Trick",
      "link": "<p><strong>5 Tips for Playing Stumble Guys to Win More Often</strong></p><p>Stumble Guys, one of the popular games played by many people. This game more or less has an arcade genre but can also be said to be a racing genre.</p><p>In Stumble Guys, you are required to compete competitively with 32 players and pass 3 stages.</p><p>The person who can complete the third stage, either the fastest or survive to the end, will later be the winner and will get a reward.</p><p>For those who like to play stumble guys and want to know how to keep winning, here I will discuss some tips.</p><p>&nbsp;</p><p><strong>Tips for Playing Stumble Guys to Win More Often</strong></p><p>In terms of gameplay, the Stumble Guys game is quite easy to play. This game is also different from competitive games in general, we can still have fun. Especially mabar time with friends.</p><p>But what you need to know, is that this game has a system where every time we win, we will get a crown that can be collected as much as possible.</p><p>So the Stumble Guys tips here will help you win the stage you are playing. Immediately, we discuss below:</p><p>&nbsp;</p><p><strong>1. Don't Rush</strong></p><p>There are several challenges in Stumble Guys and most of the stages require you to reach the finish line.</p><p>For challenges of this type, it is recommended that you do not rush to complete them. Because if you are in a hurry, later it can make you less thorough in seeing every obstacle that is in the stage.</p><p>Not to mention if you fall, then you have to return to the initial checkpoint.</p><p>&nbsp;</p><p><strong>2. Playing Timing</strong></p><p>As mentioned earlier, Stumble Guys stages have different obstacles. Well, each of these obstacles usually has its own timing.</p><p>For example, in the stage above, there are obstacles to get past the rotating hammer. In this challenge, it means that you have to pass the hammer without hitting the character you are using.</p><p>The way to get past it is to pay attention to the timing of the rotation of the hammer. You can pass after this hammer spins so it doesn't hit the character.</p><p>&nbsp;</p><p><strong>3. Learn Shortcuts</strong></p><p>In the Stumble Guys map where we have to reach the fastest finish line, there are shortcuts that can be used.</p><p>The point is, we don't go down the road that people usually use. Either by the side of the road or otherwise.</p><p>You can learn this shortcut on Youtube, because each map is usually different. Shortcuts should also be repeated until you get used to it.</p><p>&nbsp;</p><p><strong>4. Use Emotes sparingly</strong></p><p>For those who are curious about what an emote is, the emote in Stumble Guys is a feature where we can stop the opponent's movement.</p><p>Emotes can certainly be very helpful. But in the wrong conditions, emotes can actually make us lose.</p><p>Therefore, it is recommended to use the emote only as necessary. And make sure the emote timing is right.</p><p>&nbsp;</p><p><strong>5. Learn Each Stage</strong></p><p>With different stages, the completion of each stage must also be different.</p><p>For those of you who are new to playing Stumble Guys, it is recommended that you study each stage first. So you can know where the obstacles are and when the timing is right.</p>"
    },
    {
      "id": 2,
      "name_category": "News",
      "title": "Stumble Guys Best Tips and Tricks",
      "image": "https://ia601408.us.archive.org/9/items/stmblgysgd/stmblgysguide3.jpg",
      "description": "News",
      "link": "<h2><strong><em>Stumble Guys Best Tips and Tricks</em></strong></h2><p>Are you a massive runner and never bored of running through the game? If so, this Stumble Guys is the best pick for you all, guys, as this latest gaming series always stands with the gaming players. It is time to experience some of the unique gaming plots with settings as your needs. So stay with this Stumble Guys best tips guide to control the game and defeat your opponents in this endless gaming concept.</p><p><strong>Content</strong></p><ul><li><strong>Set Your Controls Before You Begin in Stumble Guys</strong></li><li><strong>Learn How to Use the Physics of Your Character to Your Advantage</strong></li><li><strong>Use the Challenges to Your Advantage</strong></li><li><strong>It is not Always about Being First</strong></li><li><strong>Rather than Waiting, Leap</strong></li><li><strong>Conclusion</strong></li></ul><p>So far, this latest game lets you fight against over 30 players and motivates you to become the champion at the end of each gaming level. You can learn from your mistakes which means you can rejoin each time you fail in the missions. Here you can play many mini-games and try them on the screen.</p><p>The Stumble Guys is one of the fantastic fun games in the gaming arena. But if you get to know the Stumble Guys best tips and tricks, you can play confidently to defeat your opponents because all the gamers try to grab the winning cup and become the champion at the end. So you have to know each Stumble Guys best tips and tricks to show your talents in these endless gaming levels as follows.</p><h2><strong>Set Your Controls Before You Begin in Stumble Guys</strong></h2><p>The beginning is the best turning point in the Stumble Guys game. Here you can use a variety of skills and also weapons throughout the battles. But first of all, you need to know that you can use different powerful tools to empower yourself to dust the opponents. From those various tools, you can enhance your power by using your mouse and keyboard, and you may construct easy control schemes.</p><p>But before going for those tools, you have to set your controls in the Stumble Guys game. Here, you can follow the steps as one of the Stumble Guys best tips.</p><ul><li>Go to the setting menu on the screen.</li><li>Visit the section of the control</li><li>Adjust your bindings without having to stop in the middle of a match.</li></ul><p>Besides the game's set controls, you can just go for the best android emulator to set some of your friendliest keys to all these actions by the Keyboard Mapping feature. Through this, it makes it easier for a player to tap and move with the game efficiently as it sets the keys that are friendliest for the player other than the usual key bindings from the game.</p><h2><strong>Learn How to Use the Physics of Your Character to Your Advantage</strong></h2><p>The most exciting part of this Stumble Guys best tips guide is that you can do the battles along with others, all of which consist of physics in the gaming levels. Here, you need to take advantage of others' weaknesses to defeat them and end the game.</p><p>In this manner, you can use your body to block the paths and lower other gamers' speeds, and you can run into someone else and distract their attention and speed up yourself in the game and do some violent actions to defeat them. So please make use of the physics of your character as we suppose in this Stumble Guys best tips guide.</p><p>You have to remember that you must not only accomplish that goal in your qualification matches to win at Stumble Guys, but you must also prevent others from doing so. Utilizing the game's mechanics to your advantage allows you to push others down and may help you achieve the objective well ahead of the competition.</p><h2><strong>Use the Challenges to Your Advantage</strong></h2><p>As a tactical gamer, you can go on basic two methods to change around in the battles. Either you can slide or run through the battles and make the win for you. But in this Stumble Guys best tips and tricks guide, we tell you that there is one more way to make advantages while you are playing.</p><p>You can use your game's challenges and boost yourself to defeat the opponents. Thus, you must avoid spinning obstacles in several of the mini-games in this Stumble Guys game because crashing into them will send you spiraling away in any direction.</p><p>Here, if you are ready to learn from your mistakes, you can probably take a big step and go forward more rapidly than other components in the game.</p><h2><strong>It is not Always about Being First </strong></h2><p>There are various mini gaming themes in the Stumble Guys game. Because each of these mini-games is different and expects more than the victory in the gaming levels, at some levels, you just need to be safe and finish the task no matter what your position is there.</p><p>When it comes to the Bombardment mini-game, we recommend you escape falling into the ocean by dodging bombs and explosions fired by a pirate boat at the platform where all players are standing in this Stumble Guys best tips and tricks guide. You can also push other components and make them fall. Also, you can dodge a watery doom by jumping, sliding, or running.</p><p>In some situations, the players try to be still and hide from the bomb attacks. So you can make it a better chance to push other players and make your space. But try not to fall like others. Because at another level, your success is based on others' losses in the battles.</p><h2><strong>Rather than Waiting, Leap</strong></h2><p>Many of the obstacles of the Stumble Guys try to drag you down. But while you mature in the game, you will realize that there is a sure way those obstacles arise in the games.</p><p>So get used to the particular obstacles, patterns, and styles that create a mess for you. That will lead you to forecast the obstacles and face them dedicatedly. Also, you can understand the best time to jump and go forward in the game.</p><p>In this Stumble Guys best tips and tricks guide, we suggest you do not wait and jump over these predetermined obstacles and make your path clear. This is one of the best Stumble Guys tips that will help you win most of your games. You will be blazing past obstacles like an expert while other components wait for it to be safe to cross in the games.</p><h2><strong>Conclusion </strong></h2><p>That brings us to the end of our Stumble Guys best tips and tricks guide. There is no way you can fail if you follow these guidelines. And we can tell you that these practical gaming strategies will be the most excellent way for the most significant gamer to advance in the game.</p>"
    },
    {
      "id": 3,
      "name_category": "Tutorial",
      "title": "How to Play Stumble Guys: Multiplayer Royale on PC Using BlueStacks",
      "image": "https://ia601408.us.archive.org/9/items/stmblgysgd/stmblgysguide4.jpg",
      "description": "Tutorial",
      "link": "https://aliendro.id/uploads/demo/guidejson/guide3.html"
    },
    {
      "id": 4,
      "name_category": "Guide",
      "title": "5 Tips and Tricks to Play on the Lava Land Map",
      "image": "https://ia601408.us.archive.org/9/items/stmblgysgd/stmblgysguide5.jpg",
      "description": "Guide",
      "link": "file:///android_asset/guide/guide2.html"
    },
    {
      "id": 5,
      "name_category": "Information",
      "title": "Stumble Guys Map Guide - The Best Tips and Tricks for Winning Every Round",
      "image": "https://ia601408.us.archive.org/9/items/stmblgysgd/stmblgysguide2.jpg",
      "description": "Information",
      "link": ""
    }
  ]
}
